"Nomes alternativos:\nNils Sjöberg\nTaylor A. Swift\nTaylor Alison Swift\n\nDescrição:\nOne of the defining artists of the 2010s, Taylor Alison Swift (born December 13, 1989) is an American singer-songwriter and actress who has achieved success in country, pop, and alternative. At the age of fourteen, Swift moved to Nashville, Tennessee to pursue a career in country music, signing to Scott Borchetta’s then-nonexistent label, Big Machine Records, in November 2004.\n\nSwift debuted in June 2006 with “Tim McGraw,” an ode to a lover who would be leaving town. The song served as an introduction to her self-titled debut album, released on October 24, 2006, which featured the songs “Teardrops on my Guitar,” “Our Song,” “Picture To Burn,” and “Should’ve Said No” as singles. This piece of work became the longest-charting album of the 2000s, spending 227 weeks on the Billboard 200.\n\nOn November 11, 2008, Swift released Fearless as her sophomore effort, which featured the songs “Fifteen,” “Love Story,” “White Horse,” and “You Belong With Me as singles. Swift herself considers this album to be her breakthrough moment, and she obviously has a reason to think so: Fearless was her first number one and it became the most awarded country album of all time. Until Billie Eilish’s 2020 win, then-20-year-old Swift was the youngest person to have ever won the Grammy Award for Album of the Year.\n\nFollowing the success of Fearless, some had doubts about Swift’s songwriting abilities, which led her to write her third album, Speak Now, alone to prove herself. The album was released on October 25, 2010, and featured “Mine,” “Back to December,” “Mean,” “The Story Of Us,” and “Ours” as singles. As a result, Swift won many awards, including a Grammy for Best Country Album.\n\nOn October 22, 2012, Swift released her fourth studio album, Red, going through a quite dramatic visual change after straightening her signature curly hair. Songs such as “I Knew You Were Trouble,” “22,” “We Are Never Ever Getting Back Together,” and “Everything Has Changed were Billboard charting singles at the time they were released. The album made Taylor be a nominee for another Grammy award for Album Of The Year in 2013, and its fifth track, “All Too Well,” was named as the best song of the 2010s by Rolling Stone.\n\nSwift’s fifth album, 1989, came out on October 27, 2014, and was her official entrance to the Pop Music scene. It featured some of her biggest hits to date as singles, like “Blank Space,” “Style,” “Out Of The Woods,” “Shake It Off,” “Bad Blood,” and “Wildest Dreams.” 1989 was also the only album of 2014 to sell over a million copies in its first week and Swift won a Grammy award for Album Of The Year with it, making her the first woman to win Album of the Year twice for different genres.\n\nAround the time of her triumphant Grammy win, Swift became entangled in a highly-publicized feud with rapper Kanye West, who claimed that his interrupting her speech at the 2009 Video Music Awards was what “made [her] famous.” After standing up for herself and claiming West never told her he would call her a “bitch” on the song, the public turned against Swift and began calling her things like a snake and a liar on social media.\n\nFollowing the backlash, Swift took a hiatus from the spotlight, breaking her typical cycle of releasing an album every two years. During this time, she has worked on songs like “This Is What You Came For,” written alongside her then-boyfriend Calvin Harris under the pseudonym Nils Sjöberg, “Better Man,” which she wrote for country group Little Big Town, and “I Don’t Wanna Live Forever,” a collaboration with ZAYN that was featured in the film Fifty Shades Darker.\n\nOn August 18, 2017, Swift wiped her social media accounts to tease the release of “Look What You Made Me Do,” released at the end of that month, and her sixth studio album, reputation, which came out on November 10, 2017. “…Ready For It?,” “End Game,” and “Delicate” were also featured as singles from that album. The record was responsible for her biggest sale at the time, selling over 1.2 million copies in the U.S.A. during its first week and also became the best-selling U.S. album of 2018.\n\nreputation was Swift’s last album with Big Machine Records before signing with Republic Records. Following her new contract, Scott Borchetta sold Big Machine Records to entertainment mogul Scooter Braun. Swift took to social media to describe her disappointment, but vowed to re-record the albums Braun purchased so she could be the full owner. Scooter Braun would later sell Taylor’s music to Shamrock Holdings in June of 2019.\n\nSwift’s dedication to artistic ownership became a large focus of the Lover era — she co-produced most tracks on the album, as well as directing or co-directing each music video. The album was released on August 23, 2019, and featured “Lover,” “The Man,” “You Need To Calm Down,” and “ME!” as the innitial singles, before “Cruel Summer” was also made a single in the summer of 2023. In November of 2019, the American Music Awards named Swift as the Artist of the Decade. That night, she also beat Michael Jackson’s record to become the artist with the most AMA wins in history, earning her 29th award. The next month, Billboard also named Swift their Woman of the Decade.\n\nIn January 2020, Swift released Miss Americana, a documentary directed by Lana Wilson that offered fans an unprecedented glimpse into Swift’s everyday life and decision to speak up about politics, alongside “Only The Young”, a political track she wrote while recording Lover.\n\nOn July 24, 2020, Swift once again switched genres – this time taking on a more alternative route – when releasing her eighth studio album, folklore, after announcing it the day before, making it her first surprise release. The only single of the album was “cardigan.” While most of her work is autobiographical, she notably focused on telling other people’s stories throughout this record. She went on to release Folklore: The Long Pond Studio Sessions on Disney+, where she performed the whole album live for the first time. folklore won the Grammy Award for Album of the Year in March 2021, making Swift the first woman and fourth artist overall to win Album of the Year three times.\n\nThe follow-up project, evermore, was released two days before Swift’s 31st birthday, on December 11, 2020, expanding the stories she told on folklore, as well as becoming her second surprise release. The only single of the record was its first track, “willow.”\n\nIn 2021, Swift’s focus was to finally start to regain ownership over her work. To make the releases more different and exciting, she added “From The Vault” tracks to each re-recording, which are songs she originally wrote for each album, but, for some reason or another, didn’t make the final cut.\n\nShe kicked off this era by releasing “Love Story (Taylor’s Version)” in February, right before making Fearless (Taylor’s Version) her first re-recorded album, released on April 9, 2021. “Mr. Perfectly Fine” was also a single from that record.\n\nSwift’s second re-recording, this time of her fourth studio album, Red, came out on November 12, 2021. As singles, it featured “I Bet You Think About Me,” and the 10 Minute Version of “All Too Well,” which became a short-film and starred the actors Sadie Sink and Dylan O'Brien.\n\nSwift’s tenth studio album, Midnights, was released on October 21, 2022, and tells the stories of many sleepless nights scattered throughout her life. The album features three singles: “Anti-Hero,” “Bejeweled,” and “Lavender Haze.” Midnights helped Swift become the first artist in history to occupy the full top 10 of the Billboard Hot 100, and broke the record for the most listened album in one day in Spotify.\n\nIn July 2023, Swift got back to re-releasing her old work. In the seventh day of that month, she released Speak Now (Taylor’s Version), which had the “From The Vault” track, “I Can See You,” as its only single. The music video for that song featured both Taylor Lautner, whom Swift had dated around the time of Speak Now’s original release, and Joey King, who had starred in the music video for “Mean” thirteen years prior.\n\nHer fourth re-recording, 1989 (Taylor’s Version), was released exactly 9 years after the original version of the album came out on October 27, 2014. The record contains five “From The Vault” tracks and Swift herself considers this to be her favorite re-recording. Before the album came out, she had already released two re-recorded songs from it as singles: “Wildest Dreams (Taylor’s Version),” on September 17, 2022, and “This Love (Taylor’s Version),” on May 6, 2022."